Revit 2024 API
BuiltInFailures.DimensionFailures.CannotConstrainBasePointDimensions Property
 Dimensions to base points cannot be constrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotConstrainBasePointDimensions { get; }
Visual Basic
Public Shared ReadOnly Property CannotConstrainBasePointDimensions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotConstrainBasePointDimensions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace